wrk2/dome/100KB/wrk-eth3-rep03.log
Running 30s test @ https://bench-eth2.netdev-lab.org/100k.bin
  4 threads and 100 connections
  Thread calibration: mean lat.: 13.294ms, rate sampling interval: 73ms
  Thread calibration: mean lat.: 13.087ms, rate sampling interval: 71ms
  Thread calibration: mean lat.: 13.307ms, rate sampling interval: 74ms
  Thread calibration: mean lat.: 29.555ms, rate sampling interval: 103ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    18.62ms   17.64ms 306.43ms   83.20%
    Req/Sec   224.55     57.57   342.00     62.15%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   13.06ms
 75.000%   30.01ms
 90.000%   41.82ms
 99.000%   57.73ms
 99.900%  176.64ms
 99.990%  269.05ms
 99.999%  306.69ms
100.000%  306.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.277     0.000000            1         1.00
       2.709     0.100000         1783         1.11
       3.451     0.200000         3565         1.25
       4.487     0.300000         5342         1.43
       8.447     0.400000         7118         1.67
      13.063     0.500000         8894         2.00
      17.055     0.550000         9785         2.22
      19.951     0.600000        10674         2.50
      24.367     0.650000        11563         2.86
      27.567     0.700000        12452         3.33
      30.015     0.750000        13341         4.00
      31.695     0.775000        13787         4.44
      33.503     0.800000        14231         5.00
      35.839     0.825000        14679         5.71
      37.375     0.850000        15120         6.67
      39.391     0.875000        15569         8.00
      40.671     0.887500        15795         8.89
      41.823     0.900000        16009        10.00
      42.943     0.912500        16234        11.43
      44.607     0.925000        16453        13.33
      46.175     0.937500        16678        16.00
      46.879     0.943750        16791        17.78
      47.583     0.950000        16905        20.00
      48.447     0.956250        17010        22.86
      49.887     0.962500        17122        26.67
      50.943     0.968750        17232        32.00
      51.647     0.971875        17294        35.56
      52.319     0.975000        17343        40.00
      53.471     0.978125        17398        45.71
      54.367     0.981250        17460        53.33
      55.167     0.984375        17511        64.00
      55.647     0.985938        17537        71.11
      56.447     0.987500        17565        80.00
      57.215     0.989062        17593        91.43
      58.111     0.990625        17621       106.67
      59.199     0.992188        17649       128.00
      59.775     0.992969        17662       142.22
      60.383     0.993750        17676       160.00
      60.927     0.994531        17690       182.86
      61.823     0.995313        17704       213.33
      62.943     0.996094        17718       256.00
      63.679     0.996484        17725       284.44
      64.543     0.996875        17732       320.00
      66.239     0.997266        17739       365.71
      68.927     0.997656        17746       426.67
      79.039     0.998047        17753       512.00
     124.735     0.998242        17756       568.89
     158.207     0.998437        17760       640.00
     163.199     0.998633        17764       731.43
     173.695     0.998828        17767       853.33
     181.375     0.999023        17770      1024.00
     214.271     0.999121        17772      1137.78
     234.111     0.999219        17774      1280.00
     238.079     0.999316        17775      1462.86
     241.023     0.999414        17777      1706.67
     241.919     0.999512        17779      2048.00
     242.943     0.999561        17780      2275.56
     260.223     0.999609        17782      2560.00
     260.223     0.999658        17782      2925.71
     260.223     0.999707        17782      3413.33
     263.679     0.999756        17783      4096.00
     265.471     0.999780        17784      4551.11
     265.471     0.999805        17784      5120.00
     265.471     0.999829        17784      5851.43
     269.055     0.999854        17785      6826.67
     269.055     0.999878        17785      8192.00
     280.831     0.999890        17786      9102.22
     280.831     0.999902        17786     10240.00
     280.831     0.999915        17786     11702.86
     280.831     0.999927        17786     13653.33
     280.831     0.999939        17786     16384.00
     306.687     0.999945        17787     18204.44
     306.687     1.000000        17787          inf
#[Mean    =       18.625, StdDeviation   =       17.638]
#[Max     =      306.432, Total count    =        17787]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  26633 requests in 30.06s, 2.55GB read
Requests/sec:    886.04
Transfer/sec:     86.77MB